#+TITLE: December 12-26, 2019 (15 days)
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 15
  :SPRINTSTART: <2019-12-12 Thu>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-gandalfdwite: 1
  :wpd-kurianbenoy: 1
  :wpd-sandeepk: 1
  :END:
** akshay196
*** IN_PROGRESS The Pragmatic Programmer: your journey to mastery [2/9]
    :PROPERTIES:
    :ESTIMATED: 15
    :ACTUAL:   7.62
    :OWNER: akshay196
    :ID: READ.1576169089
    :TASKID: READ.1576169089
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-19 Thu 07:56]--[2019-12-19 Thu 08:30] =>  0:34
    CLOCK: [2019-12-18 Wed 20:41]--[2019-12-18 Wed 20:52] =>  0:11
    CLOCK: [2019-12-18 Wed 08:30]--[2019-12-18 Wed 09:03] =>  0:33
    CLOCK: [2019-12-17 Tue 20:04]--[2019-12-17 Tue 20:56] =>  0:52
    CLOCK: [2019-12-16 Mon 09:38]--[2019-12-16 Mon 10:12] =>  0:34
    CLOCK: [2019-12-15 Sun 22:31]--[2019-12-15 Sun 23:00] =>  0:29
    CLOCK: [2019-12-15 Sun 19:00]--[2019-12-15 Sun 19:46] =>  0:46
    CLOCK: [2019-12-14 Sat 19:18]--[2019-12-14 Sat 21:12] =>  1:54
    CLOCK: [2019-12-13 Fri 19:52]--[2019-12-13 Fri 21:36] =>  1:44
    :END:
    20th Anniversary Edition, 2nd Edition
    https://learning.oreilly.com/library/view/the-pragmatic-programmer/9780135956977/
    - [X] Chapter 1. A Pragmatic Philosophy        (2h)
    - [X] Chapter 2. A Pragmatic Approach          (2h)
    - [ ] Chapter 3. The Basic Tools               (2h)
    - [ ] Chapter 4. Pragmatic Paranoia            (2h)
    - [ ] Chapter 5. Bend, or Break                (2h)
    - [ ] Chapter 6. Concurrency                   (1h)
    - [ ] Chapter 7. While You Are Coding          (2h)
    - [ ] Chapter 8. Before the Project            (1h)
    - [ ] Chapter 9. Pragmatic Projects            (1h)
** bhavin192
*** Write blog post about EmacsConf 2019
    :PROPERTIES:
    :ESTIMATED: 4.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1575286599
    :TASKID:   WRITE.1575286599
    :END:
*** Write blog post about Ansible [0/2]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1576502914
    :TASKID:   WRITE.1576502914
    :END:
    - [ ] Update the workstation setup playbook
    - [ ] Write the blog post
*** Mastering Distributed Tracing - chapter 8
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1562555265
    :TASKID:   READ.1562555265
    :END:

** gandalfdwite
*** TODO Linux Under the Hood [0/7]
    :PROPERTIES:
    :ESTIMATED: 11
    :ACTUAL:
    :OWNER: gandalfdwite
    :ID: READ.1573405076
    :TASKID: READ.1573405076
    :END:
    - [ ] 7. Understanding processes                     ( 2h )
    - [ ] 8. Security                                    ( 3h )
    - [ ] 9. Hardware Initilization                      ( 1h )
    - [ ] 10. Looking closer at the kernel               ( 2h )
    - [ ] 11. Networking                                 ( 1h )
    - [ ] 12. Performance optimization                   ( 1h )
    - [ ] 13. Future of Linux                            ( 1h )

*** TODO Write a blog post on TravisCI [0/1]
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    gandalfdwite
    :ID:       WRITE.1576074953
    :TASKID:   WRITE.1576074953
    :END:

    - [ ] Write blog post       ( 4h )
** kurianbenoy
*** DONE Swift course(FASTAI course)
  :PROPERTIES:
  :ESTIMATED: 8
  :ACTUAL: 7.13
  :OWNER: kurianbenoy
  :ID: DEV.1576217466
  :TASKID: DEV.1576217466
  :END:
  :LOGBOOK:
  CLOCK: [2019-12-19 Thu 13:06]--[2019-12-19 Thu 14:23] =>  1:17
  CLOCK: [2019-12-19 Thu 10:18]--[2019-12-19 Thu 10:39] =>  0:21
  CLOCK: [2019-12-14 Sat 07:00]--[2019-12-14 Sat 10:00] =>  3:00
  CLOCK: [2019-12-15 Sun 15:00]--[2019-12-15 Sun 17:30] =>  2:30
  :END:
  - [X] Lesson 13 (3h)
  - [X] Lesson 14 (3h)
  - [X] Blog post about Swift language and first tutorial
    https://kurianbenoy.github.io/2019-12-19-swift4tensorflowintro/
*** Read CTCI Part 2
   :PROPERTIES:
   :ESTIMATED: 6
   :ACTUAL:
   :OWNER: kurianbenoy
   :ID: READ.1576217585
   :TASKID: READ.1576217585
   :END:
   :LOGBOOK:
   CLOCK: [2019-12-23 Mon 13:48]--[2019-12-23 Mon 13:58] =>  0:10
   :END:
   - [ ] Recurssion and Dynamic Programming
   - [ ] Sorting and Searching
*** DONE Pytorch kaggle kernel & dlwpt -exercise
   :PROPERTIES:
   :ESTIMATED: 4
   :ACTUAL:
   :OWNER: kurianbenoy
   :ID: WRITE.1576217766
   :TASKID: WRITE.1576217766
   :END:
   :LOGBOOK:
   CLOCK: [2019-12-23 Mon 07:46]--[2019-12-23 Mon 08:49] =>  1:03
   CLOCK: [2019-12-23 Mon 07:00]--[2019-12-23 Mon 07:46] =>  0:46
   CLOCK: [2019-12-22 Sun 22:35]--[2019-12-23 Mon 00:10] =>  1:35
   CLOCK: [2019-12-22 Sun 19:18]--[2019-12-22 Sun 20:04] =>  0:46
   CLOCK: [2019-12-21 Sat 12:29]--[2019-12-21 Sat 13:27] =>  0:58
   CLOCK: [2019-12-21 Sat 12:03]--[2019-12-21 Sat 12:09] =>  0:06
   CLOCK: [2019-12-21 Sat 10:19]--[2019-12-21 Sat 11:00] =>  0:41
   CLOCK: [2019-12-21 Sat 00:04]--[2019-12-21 Sat 00:56] =>  0:52
   :END:
*** Learn Emacs
   :PROPERTIES:
   :ESTIMATED: 4
   :ACTUAL: 2.166
   :OWNER: kurianbenoy
   :ID: READ.1576218020
   :TASKID: READ.1576218020
   :END:
   :LOGBOOK:
   CLOCK: [2019-12-20 Fri 22:39]--[2019-12-20 Fri 23:07] =>  0:28
   CLOCK: [2019-12-20 Fri 21:42]--[2019-12-20 Fri 22:30] =>  0:48
   CLOCK: [2019-12-17 Tue 19:35]--[2019-12-17 Tue 19:42] =>  0:07
   CLOCK: [2019-12-17 Tue 14:38]--[2019-12-17 Tue 15:25] =>  0:47
   :END:
   https://geeksocket.in/posts/entering-church-emacs/#references
** sandeepk
*** IN_PROGRESS Fluent Python Part III [0/1]
    :PROPERTIES:
    :ESTIMATED: 8
    :ACTUAL:   1.02
    :OWNER: sandeepk
    :ID: READ.1573385682
    :TASKID: READ.1573385682
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-18 Wed 20:44]--[2019-12-18 Wed 21:45] =>  1:01
    :END:
    - [ ] Chapter-6  Design Patterns with First-Class Functions Part II (4h)
*** IN_PROGRESS OAuth Training [/4]
    :PROPERTIES:
    :ESTIMATED: 7
    :ACTUAL:   1.67
    :OWNER: sandeepk
    :ID: READ.1576157663
    :TASKID: READ.1576157663
    :END:
    :LOGBOOK:
    CLOCK: [2019-12-12 Thu 00:10]--[2019-12-12 Thu 02:20] =>  2:10
    :END:
    - [ ] Watch OAuth Videos  (3h)
    - [ ] Exercise 1          (2h)
    - [ ] Exercise 2          (1h)
    - [ ] Exercise 3          (1h)


